export const datasets = {
  "lab1": {
    "variant": 1,
    "task1": {
      "description": "Розрахунок мір близькості між об'єктами 5 та 7",
      "objects": [
        {"id": 5, "x1": 2, "x2": 4},
        {"id": 7, "x1": 5, "x2": 10}
      ]
    },
    "task2": {
      "description": "Побудова матриці відстаней Евкліда для об'єктів 1, 2, 3, 8",
      "metric": "Euclidean",
      "objects": [
        {"id": 1, "x1": 5, "x2": 9},
        {"id": 2, "x1": 2, "x2": 1},
        {"id": 3, "x1": 9, "x2": 5},
        {"id": 8, "x1": 8, "x2": 7}
      ]
    }
  },
  "labs2_3": {
    "description": "Набір даних на 6 об'єктів для ієрархічної кластеризації (методи найближчого та найдальшого сусіда)",
    "features": ["x (обсяг продукції)", "y (вартість фондів)"],
    "objects": [
      {"id": 1, "x": 2, "y": 8},
      {"id": 2, "x": 4, "y": 10},
      {"id": 3, "x": 5, "y": 7},
      {"id": 4, "x": 12, "y": 6},
      {"id": 5, "x": 14, "y": 6},
      {"id": 6, "x": 15, "y": 4}
    ]
  }
};
